import { useNavigate } from "react-router-dom";

import "./Home.scss";
import AppButton from "../AppButtons/AppBtn";

export default function Home() {
  let navigate = useNavigate();

  const handleGetStarted = () => {
    navigate("/signin");
  };

  return (
    <div className="home">
      <h2>Ласкаво просимо до TurboTask</h2>
      <p>
        Це ваш персональний менеджер завдань. Він дуже простий та зручний у
        роботі.
        <br />
        Залиште паперові блокноти у минулому, настала епоха всесвітньої
        цифровізації, та комп'ютеризації усіх процесів.
        <br />
        Ви можете не тільки легко редагувати, додавати чи видаляти ваші
        завдання, а також відмічати інших користувачів, що робить значно
        простішим виконання спільних завдань та дає змогу котролювати цей процес
        швидко, так як телефон завжди у вас під рукою. Ви можете встановити цей
        веб сервіс собі на телефон як на iOS так і на Android
        <br />
        Для цього необхідно в меню браузера знайти та вибрати - додати на
        головний екран та використовувати як застосунок.
      </p>
      <AppButton onClick={handleGetStarted}>Розпочати</AppButton>
    </div>
  );
}
